kodilla-soap-library/sample/book-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:kodilla="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <kodilla:getBookRequest>
            <kodilla:signature>abcd</kodilla:signature>
        </kodilla:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>